app/controllers/account_controller.rb

SELECT count(*) AS count_all FROM `users`
---
  def index
    redirect_to(:action => 'signup') unless logged_in? || User.count > 0

INSERT INTO `users` (`salt`, `city`, `created_at`, `photo_file_size`, `crypted_password`, `remember_token_expires_at`, `country`, `home_number`, `updated_at`, `postal_code`, `photo_file_name`, `fullname`, `photo_content_type`, `street`, `remember_token`, `cell_number`, `login`, `email`) VALUES('70c2b419dc75890b5230cdf1c9ad164068ed34e7', 'Sydney Mines', '2010-07-06 19:28:58', 32136, '1823891b1cd791b911103584159c74b4c424c34c', NULL, 'Canada', '', '2010-07-06 19:28:58', 'B1C 1C6', 'Kayla and Ash 3.jpg', NULL, 'image/jpeg', '1011 Shore Rd', NULL, '902-577-7197', 'kaylag', 'kaylagouthro@hotmail.com')
---
  def signup
    redirect_to logs_path
    @user = User.new(params[:user])
    return unless request.post?
    @user.save!