app/controllers/logs_controller.rb

  def show
    @log = Log.find(params[:id])
---
SELECT * FROM `logs` WHERE (`logs`.`id` = 1)

  def create
    @log = Log.new(params[:log])
    @log.user_id = current_user.id
    if @log.save
---
INSERT INTO `logs` (`category`, `created_at`, `title`, `body`, `updated_at`, `users_to_notify`, `user_id`, `status`) VALUES(NULL, '2010-06-18 17:55:16', NULL, NULL, '2010-06-18 17:55:16', NULL, NULL, NULL)

  def edit
    @log = Log.find(params[:id])
---
SELECT * FROM `logs` WHERE (`logs`.`id` = 6)

  def destroy
    @log = Log.find(params[:id])
    @log.destroy
---
SELECT * FROM `logs` WHERE (`logs`.`id` = 9)
DELETE FROM `logs` WHERE `id` = 9